espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_reg_eco2.h
/** AHB_DMA_IN_STATE_CH2_REG register
 *  Receive status of RX channel 2
 */
#define AHB_DMA_IN_STATE_CH2_REG (DR_REG_AHB_DMA_BASE + 0x204)
/** AHB_DMA_INLINK_DSCR_ADDR_CH2 : RO; bitpos: [17:0]; default: 0;
 *  reserved
 */
#define AHB_DMA_INLINK_DSCR_ADDR_CH2    0x0003FFFFU
#define AHB_DMA_INLINK_DSCR_ADDR_CH2_M  (AHB_DMA_INLINK_DSCR_ADDR_CH2_V << AHB_DMA_INLINK_DSCR_ADDR_CH2_S)
#define AHB_DMA_INLINK_DSCR_ADDR_CH2_V  0x0003FFFFU
#define AHB_DMA_INLINK_DSCR_ADDR_CH2_S  0
/** AHB_DMA_IN_DSCR_STATE_CH2 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AHB_DMA_IN_DSCR_STATE_CH2    0x00000003U
#define AHB_DMA_IN_DSCR_STATE_CH2_M  (AHB_DMA_IN_DSCR_STATE_CH2_V << AHB_DMA_IN_DSCR_STATE_CH2_S)
#define AHB_DMA_IN_DSCR_STATE_CH2_V  0x00000003U
#define AHB_DMA_IN_DSCR_STATE_CH2_S  18
/** AHB_DMA_IN_STATE_CH2 : RO; bitpos: [22:20]; default: 0;
 *  Represents the address of the lower 18 bits of the next receive descriptor to be
 *  processed.
 */
#define AHB_DMA_IN_STATE_CH2    0x00000007U
#define AHB_DMA_IN_STATE_CH2_M  (AHB_DMA_IN_STATE_CH2_V << AHB_DMA_IN_STATE_CH2_S)
#define AHB_DMA_IN_STATE_CH2_V  0x00000007U
#define AHB_DMA_IN_STATE_CH2_S  20

/** AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_REG register
 *  Receive descriptor address when EOF occurs on RX channel 2
 */
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x208)
/** AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the receive descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_M  (AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_V << AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_S)
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_S  0

/** AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_REG register
 *  Receive descriptor address when errors occur of RX channel 2
 */
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x20c)
/** AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the receive descriptor when there are some errors in the
 *  currently received data.
 */
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_M  (AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_V << AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_S)
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_S  0

/** AHB_DMA_IN_DSCR_CH2_REG register
 *  Current receive descriptor address of RX channel 2
 */
#define AHB_DMA_IN_DSCR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x210)
/** AHB_DMA_INLINK_DSCR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the next receive descriptor x+1 pointed by the current
 *  receive descriptor that has already been fetched.
 */
#define AHB_DMA_INLINK_DSCR_CH2    0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_CH2_M  (AHB_DMA_INLINK_DSCR_CH2_V << AHB_DMA_INLINK_DSCR_CH2_S)
#define AHB_DMA_INLINK_DSCR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_CH2_S  0

/** AHB_DMA_IN_DSCR_BF0_CH2_REG register
 *  The last receive descriptor address of RX channel 2
 */
#define AHB_DMA_IN_DSCR_BF0_CH2_REG (DR_REG_AHB_DMA_BASE + 0x214)
/** AHB_DMA_INLINK_DSCR_BF0_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the current receive descriptor x that has already been
 *  fetched.
 */
#define AHB_DMA_INLINK_DSCR_BF0_CH2    0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF0_CH2_M  (AHB_DMA_INLINK_DSCR_BF0_CH2_V << AHB_DMA_INLINK_DSCR_BF0_CH2_S)
#define AHB_DMA_INLINK_DSCR_BF0_CH2_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF0_CH2_S  0

/** AHB_DMA_IN_DSCR_BF1_CH2_REG register
 *  The second-to-last receive descriptor address of RX channel 2
 */
#define AHB_DMA_IN_DSCR_BF1_CH2_REG (DR_REG_AHB_DMA_BASE + 0x218)
/** AHB_DMA_INLINK_DSCR_BF1_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the previous receive descriptor x-1 that has already been
 *  fetched.
 */
#define AHB_DMA_INLINK_DSCR_BF1_CH2    0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF1_CH2_M  (AHB_DMA_INLINK_DSCR_BF1_CH2_V << AHB_DMA_INLINK_DSCR_BF1_CH2_S)
#define AHB_DMA_INLINK_DSCR_BF1_CH2_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF1_CH2_S  0

/** AHB_DMA_IN_PERI_CH2_REG register
 *  Priority register of RX channel 2
 */
#define AHB_DMA_IN_PERI_CH2_REG (DR_REG_AHB_DMA_BASE + 0x21c)
/** AHB_DMA_RX_PRI_CH2 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the priority of RX channel 2.The larger of the value, the higher of the
 *  priority..
 */
#define AHB_DMA_RX_PRI_CH2    0x0000000FU
#define AHB_DMA_RX_PRI_CH2_M  (AHB_DMA_RX_PRI_CH2_V << AHB_DMA_RX_PRI_CH2_S)
#define AHB_DMA_RX_PRI_CH2_V  0x0000000FU
#define AHB_DMA_RX_PRI_CH2_S  0

/** AHB_DMA_IN_PERI_SEL_CH2_REG register
 *  Peripheral selection register of RX channel 2
 */
#define AHB_DMA_IN_PERI_SEL_CH2_REG (DR_REG_AHB_DMA_BASE + 0x220)
/** AHB_DMA_PERI_IN_SEL_CH2 : R/W; bitpos: [5:0]; default: 63;
 *  Configures the peripheral connected to RX channel 2.
 *  0: Dummy
 *  1: SPI2
 *  2: UHCI0
 *  3: I2S0
 *  4: Dummy
 *  5: Dummy
 *  6: AES
 *  7: SHA
 *  8: ADC_DAC
 *  9: PARL_IO
 *  10: Dummy
 *  11~15: Dummy
 */
#define AHB_DMA_PERI_IN_SEL_CH2    0x0000003FU
#define AHB_DMA_PERI_IN_SEL_CH2_M  (AHB_DMA_PERI_IN_SEL_CH2_V << AHB_DMA_PERI_IN_SEL_CH2_S)
#define AHB_DMA_PERI_IN_SEL_CH2_V  0x0000003FU
#define AHB_DMA_PERI_IN_SEL_CH2_S  0

/** AHB_DMA_OUT_CONF0_CH2_REG register
 *  Configuration register 0 of TX channel 2
 */
#define AHB_DMA_OUT_CONF0_CH2_REG (DR_REG_AHB_DMA_BASE + 0x250)
/** AHB_DMA_OUT_RST_CH2 : R/W; bitpos: [0]; default: 0;
 *  Configures the reset state of AHB_DMA channel 2 TX FSM and TX FIFO pointer.
 *  0: Release reset
 *  1: Reset
 */
#define AHB_DMA_OUT_RST_CH2    (BIT(0))
#define AHB_DMA_OUT_RST_CH2_M  (AHB_DMA_OUT_RST_CH2_V << AHB_DMA_OUT_RST_CH2_S)
#define AHB_DMA_OUT_RST_CH2_V  0x00000001U
#define AHB_DMA_OUT_RST_CH2_S  0
/** AHB_DMA_OUT_LOOP_TEST_CH2 : R/W; bitpos: [1]; default: 0;
 *  reserved
 */
#define AHB_DMA_OUT_LOOP_TEST_CH2    (BIT(1))
#define AHB_DMA_OUT_LOOP_TEST_CH2_M  (AHB_DMA_OUT_LOOP_TEST_CH2_V << AHB_DMA_OUT_LOOP_TEST_CH2_S)
#define AHB_DMA_OUT_LOOP_TEST_CH2_V  0x00000001U
#define AHB_DMA_OUT_LOOP_TEST_CH2_S  1
/** AHB_DMA_OUT_AUTO_WRBACK_CH2 : R/W; bitpos: [2]; default: 0;
 *  Configures whether to enable automatic outlink write-back when all the data in TX
 *  FIFO has been transmitted.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUT_AUTO_WRBACK_CH2    (BIT(2))
#define AHB_DMA_OUT_AUTO_WRBACK_CH2_M  (AHB_DMA_OUT_AUTO_WRBACK_CH2_V << AHB_DMA_OUT_AUTO_WRBACK_CH2_S)
#define AHB_DMA_OUT_AUTO_WRBACK_CH2_V  0x00000001U
#define AHB_DMA_OUT_AUTO_WRBACK_CH2_S  2
/** AHB_DMA_OUT_EOF_MODE_CH2 : R/W; bitpos: [3]; default: 1;
 *  Configures when to generate EOF flag.
 *  0: EOF flag for TX channel 2 is generated when data to be transmitted has been
 *  pushed into FIFO in AHB_DMA.
 *  1: EOF flag for TX channel 2 is generated when data to be transmitted has been
 *  popped from FIFO in AHB_DMA.
 */
#define AHB_DMA_OUT_EOF_MODE_CH2    (BIT(3))
#define AHB_DMA_OUT_EOF_MODE_CH2_M  (AHB_DMA_OUT_EOF_MODE_CH2_V << AHB_DMA_OUT_EOF_MODE_CH2_S)
#define AHB_DMA_OUT_EOF_MODE_CH2_V  0x00000001U
#define AHB_DMA_OUT_EOF_MODE_CH2_S  3
/** AHB_DMA_OUTDSCR_BURST_EN_CH2 : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable INCR burst transfer for TX channel 2 reading
 *  descriptors.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUTDSCR_BURST_EN_CH2    (BIT(4))
#define AHB_DMA_OUTDSCR_BURST_EN_CH2_M  (AHB_DMA_OUTDSCR_BURST_EN_CH2_V << AHB_DMA_OUTDSCR_BURST_EN_CH2_S)
#define AHB_DMA_OUTDSCR_BURST_EN_CH2_V  0x00000001U
#define AHB_DMA_OUTDSCR_BURST_EN_CH2_S  4
/** AHB_DMA_OUT_ETM_EN_CH2 : R/W; bitpos: [6]; default: 0;
 *  Configures whether to enable ETM control for TX channel 2.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUT_ETM_EN_CH2    (BIT(6))
#define AHB_DMA_OUT_ETM_EN_CH2_M  (AHB_DMA_OUT_ETM_EN_CH2_V << AHB_DMA_OUT_ETM_EN_CH2_S)
#define AHB_DMA_OUT_ETM_EN_CH2_V  0x00000001U
#define AHB_DMA_OUT_ETM_EN_CH2_S  6
/** AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH2 : R/W; bitpos: [9:8]; default: 0;
 *  Configures max burst size for TX channel2.
 *  2'b00: single
 *  2'b01: incr4
 *  2'b10: incr8
 *  2'b11: incr16
 */
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH2    0x00000003U
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH2_M  (AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH2_V << AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH2_S)
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH2_V  0x00000003U
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH2_S  8

/** AHB_DMA_OUT_CONF1_CH2_REG register
 *  Configuration register 1 of TX channel 2
 */
#define AHB_DMA_OUT_CONF1_CH2_REG (DR_REG_AHB_DMA_BASE + 0x254)
/** AHB_DMA_OUT_CHECK_OWNER_CH2 : R/W; bitpos: [12]; default: 0;
 *  Configures whether to enable owner bit check for TX channel 2.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUT_CHECK_OWNER_CH2    (BIT(12))
#define AHB_DMA_OUT_CHECK_OWNER_CH2_M  (AHB_DMA_OUT_CHECK_OWNER_CH2_V << AHB_DMA_OUT_CHECK_OWNER_CH2_S)
#define AHB_DMA_OUT_CHECK_OWNER_CH2_V  0x00000001U
#define AHB_DMA_OUT_CHECK_OWNER_CH2_S  12

/** AHB_DMA_OUTFIFO_STATUS_CH2_REG register
 *  Receive FIFO status of RX channel 2
 */
#define AHB_DMA_OUTFIFO_STATUS_CH2_REG (DR_REG_AHB_DMA_BASE + 0x258)
/** AHB_DMA_OUTFIFO_FULL_CH2 : RO; bitpos: [0]; default: 0;
 *  Represents whether L1 TX FIFO is full.
 *  0: Not Full
 *  1: Full
 */
#define AHB_DMA_OUTFIFO_FULL_CH2    (BIT(0))
#define AHB_DMA_OUTFIFO_FULL_CH2_M  (AHB_DMA_OUTFIFO_FULL_CH2_V << AHB_DMA_OUTFIFO_FULL_CH2_S)
#define AHB_DMA_OUTFIFO_FULL_CH2_V  0x00000001U
#define AHB_DMA_OUTFIFO_FULL_CH2_S  0
/** AHB_DMA_OUTFIFO_EMPTY_CH2 : RO; bitpos: [1]; default: 1;
 *  Represents whether L1 TX FIFO is empty.
 *  0: Not empty
 *  1: Empty
 */
#define AHB_DMA_OUTFIFO_EMPTY_CH2    (BIT(1))
#define AHB_DMA_OUTFIFO_EMPTY_CH2_M  (AHB_DMA_OUTFIFO_EMPTY_CH2_V << AHB_DMA_OUTFIFO_EMPTY_CH2_S)
#define AHB_DMA_OUTFIFO_EMPTY_CH2_V  0x00000001U
#define AHB_DMA_OUTFIFO_EMPTY_CH2_S  1
/** AHB_DMA_OUTFIFO_CNT_CH2 : RO; bitpos: [14:8]; default: 0;
 *  Represents the number of data bytes in L1 TX FIFO for TX channel 2
 */
#define AHB_DMA_OUTFIFO_CNT_CH2    0x0000007FU
#define AHB_DMA_OUTFIFO_CNT_CH2_M  (AHB_DMA_OUTFIFO_CNT_CH2_V << AHB_DMA_OUTFIFO_CNT_CH2_S)
#define AHB_DMA_OUTFIFO_CNT_CH2_V  0x0000007FU
#define AHB_DMA_OUTFIFO_CNT_CH2_S  8
/** AHB_DMA_OUT_REMAIN_UNDER_1B_CH2 : RO; bitpos: [23]; default: 1;
 *  reserved
 */
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH2    (BIT(23))
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH2_M  (AHB_DMA_OUT_REMAIN_UNDER_1B_CH2_V << AHB_DMA_OUT_REMAIN_UNDER_1B_CH2_S)
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH2_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH2_S  23
/** AHB_DMA_OUT_REMAIN_UNDER_2B_CH2 : RO; bitpos: [24]; default: 1;
 *  reserved
 */
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH2    (BIT(24))
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH2_M  (AHB_DMA_OUT_REMAIN_UNDER_2B_CH2_V << AHB_DMA_OUT_REMAIN_UNDER_2B_CH2_S)
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH2_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH2_S  24
/** AHB_DMA_OUT_REMAIN_UNDER_3B_CH2 : RO; bitpos: [25]; default: 1;
 *  reserved
 */
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH2    (BIT(25))
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH2_M  (AHB_DMA_OUT_REMAIN_UNDER_3B_CH2_V << AHB_DMA_OUT_REMAIN_UNDER_3B_CH2_S)
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH2_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH2_S  25
/** AHB_DMA_OUT_REMAIN_UNDER_4B_CH2 : RO; bitpos: [26]; default: 1;
 *  reserved
 */
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH2    (BIT(26))
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH2_M  (AHB_DMA_OUT_REMAIN_UNDER_4B_CH2_V << AHB_DMA_OUT_REMAIN_UNDER_4B_CH2_S)
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH2_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH2_S  26

/** AHB_DMA_OUT_PUSH_CH2_REG register
 *  Push control register of TX channel 2
 */
#define AHB_DMA_OUT_PUSH_CH2_REG (DR_REG_AHB_DMA_BASE + 0x25c)
/** AHB_DMA_OUTFIFO_WDATA_CH2 : R/W; bitpos: [8:0]; default: 0;
 *  Configures whether to push data into AHB_DMA FIFO.
 *  0: Invalid. No effect
 *  1: Push
 */
#define AHB_DMA_OUTFIFO_WDATA_CH2    0x000001FFU
#define AHB_DMA_OUTFIFO_WDATA_CH2_M  (AHB_DMA_OUTFIFO_WDATA_CH2_V << AHB_DMA_OUTFIFO_WDATA_CH2_S)
#define AHB_DMA_OUTFIFO_WDATA_CH2_V  0x000001FFU
#define AHB_DMA_OUTFIFO_WDATA_CH2_S  0
/** AHB_DMA_OUTFIFO_PUSH_CH2 : WT; bitpos: [9]; default: 0;
 *  Configures the data that need to be pushed into AHB_DMA FIFO.
 */
#define AHB_DMA_OUTFIFO_PUSH_CH2    (BIT(9))
#define AHB_DMA_OUTFIFO_PUSH_CH2_M  (AHB_DMA_OUTFIFO_PUSH_CH2_V << AHB_DMA_OUTFIFO_PUSH_CH2_S)
#define AHB_DMA_OUTFIFO_PUSH_CH2_V  0x00000001U
#define AHB_DMA_OUTFIFO_PUSH_CH2_S  9

/** AHB_DMA_OUT_LINK_CH2_REG register
 *  Push control register of TX channel 2
 */
#define AHB_DMA_OUT_LINK_CH2_REG (DR_REG_AHB_DMA_BASE + 0x260)
/** AHB_DMA_OUTLINK_STOP_CH2 : WT; bitpos: [0]; default: 0;
 *  Configures whether to stop AHB_DMA's TX channel 2 from transmitting data.
 *  0: Invalid. No effect
 *  1: Stop
 */
#define AHB_DMA_OUTLINK_STOP_CH2    (BIT(0))
#define AHB_DMA_OUTLINK_STOP_CH2_M  (AHB_DMA_OUTLINK_STOP_CH2_V << AHB_DMA_OUTLINK_STOP_CH2_S)
#define AHB_DMA_OUTLINK_STOP_CH2_V  0x00000001U
#define AHB_DMA_OUTLINK_STOP_CH2_S  0
/** AHB_DMA_OUTLINK_START_CH2 : WT; bitpos: [1]; default: 0;
 *  Configures whether to enable AHB_DMA's TX channel 2 for data transfer.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUTLINK_START_CH2    (BIT(1))
#define AHB_DMA_OUTLINK_START_CH2_M  (AHB_DMA_OUTLINK_START_CH2_V << AHB_DMA_OUTLINK_START_CH2_S)
#define AHB_DMA_OUTLINK_START_CH2_V  0x00000001U
#define AHB_DMA_OUTLINK_START_CH2_S  1
/** AHB_DMA_OUTLINK_RESTART_CH2 : WT; bitpos: [2]; default: 0;
 *  Configures whether to restart TX channel 2 for AHB_DMA transfer.
 *  0: Invalid. No effect
 *  1: Restart
 */
#define AHB_DMA_OUTLINK_RESTART_CH2    (BIT(2))
#define AHB_DMA_OUTLINK_RESTART_CH2_M  (AHB_DMA_OUTLINK_RESTART_CH2_V << AHB_DMA_OUTLINK_RESTART_CH2_S)
#define AHB_DMA_OUTLINK_RESTART_CH2_V  0x00000001U
#define AHB_DMA_OUTLINK_RESTART_CH2_S  2
/** AHB_DMA_OUTLINK_PARK_CH2 : RO; bitpos: [3]; default: 1;
 *  Represents the status of the transmit descriptor's FSM.
 *  0: Running
 *  1: Idle
 */
#define AHB_DMA_OUTLINK_PARK_CH2    (BIT(3))
#define AHB_DMA_OUTLINK_PARK_CH2_M  (AHB_DMA_OUTLINK_PARK_CH2_V << AHB_DMA_OUTLINK_PARK_CH2_S)
#define AHB_DMA_OUTLINK_PARK_CH2_V  0x00000001U
#define AHB_DMA_OUTLINK_PARK_CH2_S  3

/** AHB_DMA_OUT_STATE_CH2_REG register
 *  Transmit status of TX channel 2
 */
#define AHB_DMA_OUT_STATE_CH2_REG (DR_REG_AHB_DMA_BASE + 0x264)
/** AHB_DMA_OUTLINK_DSCR_ADDR_CH2 : RO; bitpos: [17:0]; default: 0;
 *  Represents the lower 18 bits of the address of the next transmit descriptor to be
 *  processed.
 */
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH2    0x0003FFFFU
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH2_M  (AHB_DMA_OUTLINK_DSCR_ADDR_CH2_V << AHB_DMA_OUTLINK_DSCR_ADDR_CH2_S)
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH2_V  0x0003FFFFU
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH2_S  0
/** AHB_DMA_OUT_DSCR_STATE_CH2 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AHB_DMA_OUT_DSCR_STATE_CH2    0x00000003U
#define AHB_DMA_OUT_DSCR_STATE_CH2_M  (AHB_DMA_OUT_DSCR_STATE_CH2_V << AHB_DMA_OUT_DSCR_STATE_CH2_S)
#define AHB_DMA_OUT_DSCR_STATE_CH2_V  0x00000003U
#define AHB_DMA_OUT_DSCR_STATE_CH2_S  18
/** AHB_DMA_OUT_STATE_CH2 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define AHB_DMA_OUT_STATE_CH2    0x00000007U
#define AHB_DMA_OUT_STATE_CH2_M  (AHB_DMA_OUT_STATE_CH2_V << AHB_DMA_OUT_STATE_CH2_S)
#define AHB_DMA_OUT_STATE_CH2_V  0x00000007U
#define AHB_DMA_OUT_STATE_CH2_S  20

/** AHB_DMA_OUT_EOF_DES_ADDR_CH2_REG register
 *  Transmit descriptor address when EOF occurs on TX channel 2
 */
#define AHB_DMA_OUT_EOF_DES_ADDR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x268)
/** AHB_DMA_OUT_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the transmit descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AHB_DMA_OUT_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define AHB_DMA_OUT_EOF_DES_ADDR_CH2_M  (AHB_DMA_OUT_EOF_DES_ADDR_CH2_V << AHB_DMA_OUT_EOF_DES_ADDR_CH2_S)
#define AHB_DMA_OUT_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_OUT_EOF_DES_ADDR_CH2_S  0

/** AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH2_REG register
 *  The last transmit descriptor address when EOF occurs on TX channel 2
 */
#define AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x26c)
/** AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the transmit descriptor before the last transmit
 *  descriptor.
 */
#define AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH2    0xFFFFFFFFU
#define AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH2_M  (AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH2_V << AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH2_S)
#define AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH2_S  0

/** AHB_DMA_OUT_DSCR_CH2_REG register
 *  Current transmit descriptor address of TX channel 2
 */
#define AHB_DMA_OUT_DSCR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x270)
/** AHB_DMA_OUTLINK_DSCR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the next transmit descriptor y+1 pointed by the current
 *  transmit descriptor that has already been fetched.
 */
#define AHB_DMA_OUTLINK_DSCR_CH2    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_CH2_M  (AHB_DMA_OUTLINK_DSCR_CH2_V << AHB_DMA_OUTLINK_DSCR_CH2_S)
#define AHB_DMA_OUTLINK_DSCR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_CH2_S  0

