espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_reg_eco2.h
/** AHB_DMA_OUT_DSCR_BF0_CH2_REG register
 *  The last transmit descriptor address of TX channel 2
 */
#define AHB_DMA_OUT_DSCR_BF0_CH2_REG (DR_REG_AHB_DMA_BASE + 0x274)
/** AHB_DMA_OUTLINK_DSCR_BF0_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the current transmit descriptor y that has already been
 *  fetched.
 */
#define AHB_DMA_OUTLINK_DSCR_BF0_CH2    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF0_CH2_M  (AHB_DMA_OUTLINK_DSCR_BF0_CH2_V << AHB_DMA_OUTLINK_DSCR_BF0_CH2_S)
#define AHB_DMA_OUTLINK_DSCR_BF0_CH2_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF0_CH2_S  0

/** AHB_DMA_OUT_DSCR_BF1_CH2_REG register
 *  The second-to-last transmit descriptor address of TX channel 2
 */
#define AHB_DMA_OUT_DSCR_BF1_CH2_REG (DR_REG_AHB_DMA_BASE + 0x278)
/** AHB_DMA_OUTLINK_DSCR_BF1_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the previous transmit descriptor y-1 that has already
 *  been fetched.
 */
#define AHB_DMA_OUTLINK_DSCR_BF1_CH2    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF1_CH2_M  (AHB_DMA_OUTLINK_DSCR_BF1_CH2_V << AHB_DMA_OUTLINK_DSCR_BF1_CH2_S)
#define AHB_DMA_OUTLINK_DSCR_BF1_CH2_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF1_CH2_S  0

/** AHB_DMA_OUT_PERI_CH2_REG register
 *  Priority register of TX channel 2
 */
#define AHB_DMA_OUT_PERI_CH2_REG (DR_REG_AHB_DMA_BASE + 0x27c)
/** AHB_DMA_TX_PRI_CH2 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the priority of TX channel 2.The larger of the value, the higher of the
 *  priority..
 */
#define AHB_DMA_TX_PRI_CH2    0x0000000FU
#define AHB_DMA_TX_PRI_CH2_M  (AHB_DMA_TX_PRI_CH2_V << AHB_DMA_TX_PRI_CH2_S)
#define AHB_DMA_TX_PRI_CH2_V  0x0000000FU
#define AHB_DMA_TX_PRI_CH2_S  0

/** AHB_DMA_OUT_PERI_SEL_CH2_REG register
 *  Peripheral selection register of TX channel 2
 */
#define AHB_DMA_OUT_PERI_SEL_CH2_REG (DR_REG_AHB_DMA_BASE + 0x280)
/** AHB_DMA_PERI_OUT_SEL_CH2 : R/W; bitpos: [5:0]; default: 63;
 *  Configures the peripheral connected to TX channel 2.
 *  0: Dummy
 *  1: SPI2
 *  2: UHCI0
 *  3: I2S0
 *  4: Dummy
 *  5: Dummy
 *  6: AES
 *  7: SHA
 *  8: ADC_DAC
 *  9: PARL_IO
 *  10: Dummy
 *  11~15: Dummy
 *  \
 */
#define AHB_DMA_PERI_OUT_SEL_CH2    0x0000003FU
#define AHB_DMA_PERI_OUT_SEL_CH2_M  (AHB_DMA_PERI_OUT_SEL_CH2_V << AHB_DMA_PERI_OUT_SEL_CH2_S)
#define AHB_DMA_PERI_OUT_SEL_CH2_V  0x0000003FU
#define AHB_DMA_PERI_OUT_SEL_CH2_S  0

/** AHB_DMA_TX_CH_ARB_WEIGHT_CH0_REG register
 *  TX channel 0 arbitration weight configuration register
 */
#define AHB_DMA_TX_CH_ARB_WEIGHT_CH0_REG (DR_REG_AHB_DMA_BASE + 0x2dc)
/** AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of TX channel0
 */
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0    0x0000000FU
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0_M  (AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0_V << AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0_S)
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0_V  0x0000000FU
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH0_S  0

/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIR_CH0_REG register
 *  TX channel 0 weight arbitration optimization enable register
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIR_CH0_REG (DR_REG_AHB_DMA_BASE + 0x2e0)
/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0    (BIT(0))
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_M  (AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_V << AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_S)
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_V  0x00000001U
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_S  0

/** AHB_DMA_TX_CH_ARB_WEIGHT_CH1_REG register
 *  TX channel 1 arbitration weight configuration register
 */
#define AHB_DMA_TX_CH_ARB_WEIGHT_CH1_REG (DR_REG_AHB_DMA_BASE + 0x304)
/** AHB_DMA_TX_ARB_WEIGHT_VALUE_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of TX channel1
 */
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH1    0x0000000FU
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH1_M  (AHB_DMA_TX_ARB_WEIGHT_VALUE_CH1_V << AHB_DMA_TX_ARB_WEIGHT_VALUE_CH1_S)
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH1_V  0x0000000FU
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH1_S  0

/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIR_CH1_REG register
 *  TX channel 1 weight arbitration optimization enable register
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x308)
/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1    (BIT(0))
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_M  (AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_V << AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_S)
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_V  0x00000001U
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_S  0

/** AHB_DMA_TX_CH_ARB_WEIGHT_CH2_REG register
 *  TX channel 2 arbitration weight configuration register
 */
#define AHB_DMA_TX_CH_ARB_WEIGHT_CH2_REG (DR_REG_AHB_DMA_BASE + 0x32c)
/** AHB_DMA_TX_ARB_WEIGHT_VALUE_CH2 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of TX channel2
 */
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH2    0x0000000FU
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH2_M  (AHB_DMA_TX_ARB_WEIGHT_VALUE_CH2_V << AHB_DMA_TX_ARB_WEIGHT_VALUE_CH2_S)
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH2_V  0x0000000FU
#define AHB_DMA_TX_ARB_WEIGHT_VALUE_CH2_S  0

/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIR_CH2_REG register
 *  TX channel 2 weight arbitration optimization enable register
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x330)
/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH2 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH2    (BIT(0))
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH2_M  (AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH2_V << AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH2_S)
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH2_V  0x00000001U
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH2_S  0

/** AHB_DMA_RX_CH_ARB_WEIGHT_CH0_REG register
 *  RX channel 0 arbitration weight configuration register
 */
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH0_REG (DR_REG_AHB_DMA_BASE + 0x354)
/** AHB_DMA_RX_ARB_WEIGHT_VALUE_CH0 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of RX channel0
 */
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH0    0x0000000FU
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH0_M  (AHB_DMA_RX_ARB_WEIGHT_VALUE_CH0_V << AHB_DMA_RX_ARB_WEIGHT_VALUE_CH0_S)
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH0_V  0x0000000FU
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH0_S  0

/** AHB_DMA_RX_ARB_WEIGHT_OPT_DIR_CH0_REG register
 *  RX channel 0 weight arbitration optimization enable register
 */
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIR_CH0_REG (DR_REG_AHB_DMA_BASE + 0x358)
/** AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0    (BIT(0))
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_M  (AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_V << AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_S)
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_V  0x00000001U
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_S  0

/** AHB_DMA_RX_CH_ARB_WEIGHT_CH1_REG register
 *  RX channel 1 arbitration weight configuration register
 */
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH1_REG (DR_REG_AHB_DMA_BASE + 0x37c)
/** AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of RX channel1
 */
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1    0x0000000FU
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1_M  (AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1_V << AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1_S)
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1_V  0x0000000FU
#define AHB_DMA_RX_ARB_WEIGHT_VALUE_CH1_S  0

/** AHB_DMA_RX_ARB_WEIGHT_OPT_DIR_CH1_REG register
 *  RX channel 1 weight arbitration optimization enable register
 */
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x380)
/** AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1    (BIT(0))
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_M  (AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_V << AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_S)
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_V  0x00000001U
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_S  0

