espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_reg_eco2.h
/** AHB_DMA_WEIGHT_EN_TX_REG register
 *  TX weight arbitration enable register
 */
#define AHB_DMA_WEIGHT_EN_TX_REG (DR_REG_AHB_DMA_BASE + 0x3d4)
/** AHB_DMA_WEIGHT_EN_TX : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable weight arbitration for TX.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_WEIGHT_EN_TX    (BIT(0))
#define AHB_DMA_WEIGHT_EN_TX_M  (AHB_DMA_WEIGHT_EN_TX_V << AHB_DMA_WEIGHT_EN_TX_S)
#define AHB_DMA_WEIGHT_EN_TX_V  0x00000001U
#define AHB_DMA_WEIGHT_EN_TX_S  0

/** AHB_DMA_WEIGHT_EN_RX_REG register
 *  RX weight arbitration enable register
 */
#define AHB_DMA_WEIGHT_EN_RX_REG (DR_REG_AHB_DMA_BASE + 0x3d8)
/** AHB_DMA_WEIGHT_EN_RX : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable weight arbitration for RX.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_WEIGHT_EN_RX    (BIT(0))
#define AHB_DMA_WEIGHT_EN_RX_M  (AHB_DMA_WEIGHT_EN_RX_V << AHB_DMA_WEIGHT_EN_RX_S)
#define AHB_DMA_WEIGHT_EN_RX_V  0x00000001U
#define AHB_DMA_WEIGHT_EN_RX_S  0

/** AHB_DMA_ARB_TIMEOUT_REG register
 *  TX arbitration timeout configuration register
 */
#define AHB_DMA_ARB_TIMEOUT_REG (DR_REG_AHB_DMA_BASE + 0x3dc)
/** AHB_DMA_ARB_TIMEOUT_NUM : R/W; bitpos: [15:0]; default: 0;
 *  Configures the time slot. Measurement unit: AHB bus clock cycle.
 */
#define AHB_DMA_ARB_TIMEOUT_NUM    0x0000FFFFU
#define AHB_DMA_ARB_TIMEOUT_NUM_M  (AHB_DMA_ARB_TIMEOUT_NUM_V << AHB_DMA_ARB_TIMEOUT_NUM_S)
#define AHB_DMA_ARB_TIMEOUT_NUM_V  0x0000FFFFU
#define AHB_DMA_ARB_TIMEOUT_NUM_S  0

/** AHB_DMA_WEIGHT_EN_REG register
 *  TX weight arbitration enable register
 */
#define AHB_DMA_WEIGHT_EN_REG (DR_REG_AHB_DMA_BASE + 0x400)
/** AHB_DMA_WEIGHT_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable weight arbitration.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_WEIGHT_EN    (BIT(0))
#define AHB_DMA_WEIGHT_EN_M  (AHB_DMA_WEIGHT_EN_V << AHB_DMA_WEIGHT_EN_S)
#define AHB_DMA_WEIGHT_EN_V  0x00000001U
#define AHB_DMA_WEIGHT_EN_S  0

/** AHB_DMA_MODULE_CLK_EN_REG register
 *  Module clock force on register
 */
#define AHB_DMA_MODULE_CLK_EN_REG (DR_REG_AHB_DMA_BASE + 0x404)
/** AHB_DMA_AHB_APB_SYNC_CLK_EN : R/W; bitpos: [2:0]; default: 7;
 *  Configures whether to force on ahb_apb_sync 2~0 module clock. For bit n:
 *  0 : Not force on ahb_apb_sync n clock
 *  1 : Force on ahb_apb_sync n clock
 */
#define AHB_DMA_AHB_APB_SYNC_CLK_EN    0x00000007U
#define AHB_DMA_AHB_APB_SYNC_CLK_EN_M  (AHB_DMA_AHB_APB_SYNC_CLK_EN_V << AHB_DMA_AHB_APB_SYNC_CLK_EN_S)
#define AHB_DMA_AHB_APB_SYNC_CLK_EN_V  0x00000007U
#define AHB_DMA_AHB_APB_SYNC_CLK_EN_S  0
/** AHB_DMA_OUT_DSCR_CLK_EN : R/W; bitpos: [5:3]; default: 7;
 *  Configures whether to force on out_dscr 2~0 module clock. For bit n:
 *  0 : Not force on out_dscr n clock
 *  1 : Force on out_dscr n clock
 */
#define AHB_DMA_OUT_DSCR_CLK_EN    0x00000007U
#define AHB_DMA_OUT_DSCR_CLK_EN_M  (AHB_DMA_OUT_DSCR_CLK_EN_V << AHB_DMA_OUT_DSCR_CLK_EN_S)
#define AHB_DMA_OUT_DSCR_CLK_EN_V  0x00000007U
#define AHB_DMA_OUT_DSCR_CLK_EN_S  3
/** AHB_DMA_OUT_CTRL_CLK_EN : R/W; bitpos: [8:6]; default: 7;
 *  Configures whether to force on out_ctrl 2~0 module clock. For bit n:
 *  0 : Not force on out_ctrl n clock
 *  1 : Force on out_ctrl n clock
 */
#define AHB_DMA_OUT_CTRL_CLK_EN    0x00000007U
#define AHB_DMA_OUT_CTRL_CLK_EN_M  (AHB_DMA_OUT_CTRL_CLK_EN_V << AHB_DMA_OUT_CTRL_CLK_EN_S)
#define AHB_DMA_OUT_CTRL_CLK_EN_V  0x00000007U
#define AHB_DMA_OUT_CTRL_CLK_EN_S  6
/** AHB_DMA_IN_DSCR_CLK_EN : R/W; bitpos: [11:9]; default: 7;
 *  Configures whether to force on in_dscr 2~0 module clock. For bit n:
 *  0 : Not force on in_dscr n clock
 *  1 : Force on in_dscr n clock
 */
#define AHB_DMA_IN_DSCR_CLK_EN    0x00000007U
#define AHB_DMA_IN_DSCR_CLK_EN_M  (AHB_DMA_IN_DSCR_CLK_EN_V << AHB_DMA_IN_DSCR_CLK_EN_S)
#define AHB_DMA_IN_DSCR_CLK_EN_V  0x00000007U
#define AHB_DMA_IN_DSCR_CLK_EN_S  9
/** AHB_DMA_IN_CTRL_CLK_EN : R/W; bitpos: [14:12]; default: 7;
 *  Configures whether to force on in_ctrl 2~0 module clock. For bit n:
 *  0 : Not force on in_ctrl n clock
 *  1 : Force on in_ctrl n clock
 */
#define AHB_DMA_IN_CTRL_CLK_EN    0x00000007U
#define AHB_DMA_IN_CTRL_CLK_EN_M  (AHB_DMA_IN_CTRL_CLK_EN_V << AHB_DMA_IN_CTRL_CLK_EN_S)
#define AHB_DMA_IN_CTRL_CLK_EN_V  0x00000007U
#define AHB_DMA_IN_CTRL_CLK_EN_S  12
/** AHB_DMA_CMD_ARB_CLK_EN : R/W; bitpos: [27]; default: 0;
 *  Configures whether to force on cmd_arb module clock.
 *  0 : Not force on cmd_arb clock
 *  1 : Force on cmd_arb clock
 */
#define AHB_DMA_CMD_ARB_CLK_EN    (BIT(27))
#define AHB_DMA_CMD_ARB_CLK_EN_M  (AHB_DMA_CMD_ARB_CLK_EN_V << AHB_DMA_CMD_ARB_CLK_EN_S)
#define AHB_DMA_CMD_ARB_CLK_EN_V  0x00000001U
#define AHB_DMA_CMD_ARB_CLK_EN_S  27
/** AHB_DMA_AHBINF_CLK_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether to force on ahbinf module clock.
 *  0 : Not force on ahbinf clock
 *  1 : Force on ahbinf clock
 */
#define AHB_DMA_AHBINF_CLK_EN    (BIT(28))
#define AHB_DMA_AHBINF_CLK_EN_M  (AHB_DMA_AHBINF_CLK_EN_V << AHB_DMA_AHBINF_CLK_EN_S)
#define AHB_DMA_AHBINF_CLK_EN_V  0x00000001U
#define AHB_DMA_AHBINF_CLK_EN_S  28

/** AHB_DMA_AHBINF_RESP_ERR_STATUS0_REG register
 *  AHB response error status 0 register
 */
#define AHB_DMA_AHBINF_RESP_ERR_STATUS0_REG (DR_REG_AHB_DMA_BASE + 0x408)
/** AHB_DMA_AHBINF_RESP_ERR_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the AHB response error.
 */
#define AHB_DMA_AHBINF_RESP_ERR_ADDR    0xFFFFFFFFU
#define AHB_DMA_AHBINF_RESP_ERR_ADDR_M  (AHB_DMA_AHBINF_RESP_ERR_ADDR_V << AHB_DMA_AHBINF_RESP_ERR_ADDR_S)
#define AHB_DMA_AHBINF_RESP_ERR_ADDR_V  0xFFFFFFFFU
#define AHB_DMA_AHBINF_RESP_ERR_ADDR_S  0

/** AHB_DMA_AHBINF_RESP_ERR_STATUS1_REG register
 *  AHB response error status 1 register
 */
#define AHB_DMA_AHBINF_RESP_ERR_STATUS1_REG (DR_REG_AHB_DMA_BASE + 0x40c)
/** AHB_DMA_AHBINF_RESP_ERR_WR : RO; bitpos: [0]; default: 0;
 *  Represents the AHB response error is write request.
 */
#define AHB_DMA_AHBINF_RESP_ERR_WR    (BIT(0))
#define AHB_DMA_AHBINF_RESP_ERR_WR_M  (AHB_DMA_AHBINF_RESP_ERR_WR_V << AHB_DMA_AHBINF_RESP_ERR_WR_S)
#define AHB_DMA_AHBINF_RESP_ERR_WR_V  0x00000001U
#define AHB_DMA_AHBINF_RESP_ERR_WR_S  0
/** AHB_DMA_AHBINF_RESP_ERR_ID : RO; bitpos: [4:1]; default: 15;
 *  Represents the AHB response error request id.
 */
#define AHB_DMA_AHBINF_RESP_ERR_ID    0x0000000FU
#define AHB_DMA_AHBINF_RESP_ERR_ID_M  (AHB_DMA_AHBINF_RESP_ERR_ID_V << AHB_DMA_AHBINF_RESP_ERR_ID_S)
#define AHB_DMA_AHBINF_RESP_ERR_ID_V  0x0000000FU
#define AHB_DMA_AHBINF_RESP_ERR_ID_S  1
/** AHB_DMA_AHBINF_RESP_ERR_CH_ID : RO; bitpos: [7:5]; default: 0;
 *  Represents the AHB response error request channel id.bit[2]=1:TX channel.
 *  bit[2]=0:RX channel.
 */
#define AHB_DMA_AHBINF_RESP_ERR_CH_ID    0x00000007U
#define AHB_DMA_AHBINF_RESP_ERR_CH_ID_M  (AHB_DMA_AHBINF_RESP_ERR_CH_ID_V << AHB_DMA_AHBINF_RESP_ERR_CH_ID_S)
#define AHB_DMA_AHBINF_RESP_ERR_CH_ID_V  0x00000007U
#define AHB_DMA_AHBINF_RESP_ERR_CH_ID_S  5

/** AHB_DMA_IN_DONE_DES_ADDR_CH0_REG register
 *  RX_done Inlink descriptor address of RX channel 0
 */
#define AHB_DMA_IN_DONE_DES_ADDR_CH0_REG (DR_REG_AHB_DMA_BASE + 0x410)
/** AHB_DMA_IN_DONE_DES_ADDR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the inlink descriptor when  this descriptor is completed .
 */
#define AHB_DMA_IN_DONE_DES_ADDR_CH0    0xFFFFFFFFU
#define AHB_DMA_IN_DONE_DES_ADDR_CH0_M  (AHB_DMA_IN_DONE_DES_ADDR_CH0_V << AHB_DMA_IN_DONE_DES_ADDR_CH0_S)
#define AHB_DMA_IN_DONE_DES_ADDR_CH0_V  0xFFFFFFFFU
#define AHB_DMA_IN_DONE_DES_ADDR_CH0_S  0

/** AHB_DMA_OUT_DONE_DES_ADDR_CH0_REG register
 *  TX done outlink descriptor address of TX channel 0
 */
#define AHB_DMA_OUT_DONE_DES_ADDR_CH0_REG (DR_REG_AHB_DMA_BASE + 0x414)
/** AHB_DMA_OUT_DONE_DES_ADDR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the outlink descriptor when this descriptor is completed.
 */
#define AHB_DMA_OUT_DONE_DES_ADDR_CH0    0xFFFFFFFFU
#define AHB_DMA_OUT_DONE_DES_ADDR_CH0_M  (AHB_DMA_OUT_DONE_DES_ADDR_CH0_V << AHB_DMA_OUT_DONE_DES_ADDR_CH0_S)
#define AHB_DMA_OUT_DONE_DES_ADDR_CH0_V  0xFFFFFFFFU
#define AHB_DMA_OUT_DONE_DES_ADDR_CH0_S  0

